{
  "class_name": "Functional",
  "config": {
    "name": "model",
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [null, 416, 416, 3],
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_1"
        },
        "name": "input_1",
        "inbound_nodes": []
      },
      {
        "class_name": "TFOpLambda",
        "config": {
          "name": "tf.math.truediv",
          "trainable": true,
          "dtype": "float32",
          "function": "math.truediv"
        },
        "name": "tf.math.truediv",
        "inbound_nodes": [["input_1", 0, 0, { "y": 255.0, "name": null }]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_0",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_0",
        "inbound_nodes": [[["tf.math.truediv", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_0",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_0",
        "inbound_nodes": [[["conv_0", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_0",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_0",
        "inbound_nodes": [[["bnorm_0", 0, 0, {}]]]
      },
      {
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 0],
            [1, 0]
          ],
          "data_format": "channels_last"
        },
        "name": "zero_padding2d",
        "inbound_nodes": [[["leaky_0", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_1",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [2, 2],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_1",
        "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_1",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_1",
        "inbound_nodes": [[["conv_1", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_1",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_1",
        "inbound_nodes": [[["bnorm_1", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_2",
          "trainable": true,
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_2",
        "inbound_nodes": [[["leaky_1", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_2",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_2",
        "inbound_nodes": [[["conv_2", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_2",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_2",
        "inbound_nodes": [[["bnorm_2", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_3",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_3",
        "inbound_nodes": [[["leaky_2", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_3",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_3",
        "inbound_nodes": [[["conv_3", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_3",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_3",
        "inbound_nodes": [[["bnorm_3", 0, 0, {}]]]
      },
      {
        "class_name": "TFOpLambda",
        "config": {
          "name": "tf.__operators__.add",
          "trainable": true,
          "dtype": "float32",
          "function": "__operators__.add"
        },
        "name": "tf.__operators__.add",
        "inbound_nodes": [
          ["leaky_3", 0, 0, { "y": ["leaky_1", 0, 0], "name": null }]
        ]
      },
      {
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_1",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 0],
            [1, 0]
          ],
          "data_format": "channels_last"
        },
        "name": "zero_padding2d_1",
        "inbound_nodes": [[["tf.__operators__.add", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_5",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [2, 2],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_5",
        "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_5",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_5",
        "inbound_nodes": [[["conv_5", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_5",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_5",
        "inbound_nodes": [[["bnorm_5", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_6",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_6",
        "inbound_nodes": [[["leaky_5", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_6",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_6",
        "inbound_nodes": [[["conv_6", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_6",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_6",
        "inbound_nodes": [[["bnorm_6", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_7",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_7",
        "inbound_nodes": [[["leaky_6", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_7",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_7",
        "inbound_nodes": [[["conv_7", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_7",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_7",
        "inbound_nodes": [[["bnorm_7", 0, 0, {}]]]
      },
      {
        "class_name": "TFOpLambda",
        "config": {
          "name": "tf.__operators__.add_1",
          "trainable": true,
          "dtype": "float32",
          "function": "__operators__.add"
        },
        "name": "tf.__operators__.add_1",
        "inbound_nodes": [
          ["leaky_7", 0, 0, { "y": ["leaky_5", 0, 0], "name": null }]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_9",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_9",
        "inbound_nodes": [[["tf.__operators__.add_1", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_9",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_9",
        "inbound_nodes": [[["conv_9", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_9",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_9",
        "inbound_nodes": [[["bnorm_9", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_10",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_10",
        "inbound_nodes": [[["leaky_9", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_10",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_10",
        "inbound_nodes": [[["conv_10", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_10",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_10",
        "inbound_nodes": [[["bnorm_10", 0, 0, {}]]]
      },
      {
        "class_name": "TFOpLambda",
        "config": {
          "name": "tf.__operators__.add_2",
          "trainable": true,
          "dtype": "float32",
          "function": "__operators__.add"
        },
        "name": "tf.__operators__.add_2",
        "inbound_nodes": [
          [
            "leaky_10",
            0,
            0,
            { "y": ["tf.__operators__.add_1", 0, 0], "name": null }
          ]
        ]
      },
      {
        "class_name": "ZeroPadding2D",
        "config": {
          "name": "zero_padding2d_2",
          "trainable": true,
          "dtype": "float32",
          "padding": [
            [1, 0],
            [1, 0]
          ],
          "data_format": "channels_last"
        },
        "name": "zero_padding2d_2",
        "inbound_nodes": [[["tf.__operators__.add_2", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_12",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [2, 2],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_12",
        "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_12",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_12",
        "inbound_nodes": [[["conv_12", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_12",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_12",
        "inbound_nodes": [[["bnorm_12", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_13",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_13",
        "inbound_nodes": [[["leaky_12", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_13",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_13",
        "inbound_nodes": [[["conv_13", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_13",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_13",
        "inbound_nodes": [[["bnorm_13", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_14",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_14",
        "inbound_nodes": [[["leaky_13", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_14",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_14",
        "inbound_nodes": [[["conv_14", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_14",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_14",
        "inbound_nodes": [[["bnorm_14", 0, 0, {}]]]
      },
      {
        "class_name": "TFOpLambda",
        "config": {
          "name": "tf.__operators__.add_3",
          "trainable": true,
          "dtype": "float32",
          "function": "__operators__.add"
        },
        "name": "tf.__operators__.add_3",
        "inbound_nodes": [
          ["leaky_14", 0, 0, { "y": ["leaky_12", 0, 0], "name": null }]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_16",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_16",
        "inbound_nodes": [[["tf.__operators__.add_3", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_16",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_16",
        "inbound_nodes": [[["conv_16", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_16",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_16",
        "inbound_nodes": [[["bnorm_16", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_17",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_17",
        "inbound_nodes": [[["leaky_16", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_17",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_17",
        "inbound_nodes": [[["conv_17", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_17",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_17",
        "inbound_nodes": [[["bnorm_17", 0, 0, {}]]]
      },
      {
        "class_name": "TFOpLambda",
        "config": {
          "name": "tf.__operators__.add_4",
          "trainable": true,
          "dtype": "float32",
          "function": "__operators__.add"
        },
        "name": "tf.__operators__.add_4",
        "inbound_nodes": [
          [
            "leaky_17",
            0,
            0,
            { "y": ["tf.__operators__.add_3", 0, 0], "name": null }
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_19",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_19",
        "inbound_nodes": [[["tf.__operators__.add_4", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_19",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_19",
        "inbound_nodes": [[["conv_19", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_19",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_19",
        "inbound_nodes": [[["bnorm_19", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_20",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_20",
        "inbound_nodes": [[["leaky_19", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_20",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_20",
        "inbound_nodes": [[["conv_20", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_20",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_20",
        "inbound_nodes": [[["bnorm_20", 0, 0, {}]]]
      },
      {
        "class_name": "TFOpLambda",
        "config": {
          "name": "tf.__operators__.add_5",
          "trainable": true,
          "dtype": "float32",
          "function": "__operators__.add"
        },
        "name": "tf.__operators__.add_5",
        "inbound_nodes": [
          [
            "leaky_20",
            0,
            0,
            { "y": ["tf.__operators__.add_4", 0, 0], "name": null }
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_22",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_22",
        "inbound_nodes": [[["tf.__operators__.add_5", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_22",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_22",
        "inbound_nodes": [[["conv_22", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_22",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_22",
        "inbound_nodes": [[["bnorm_22", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_23",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_23",
        "inbound_nodes": [[["leaky_22", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_23",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_23",
        "inbound_nodes": [[["conv_23", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_23",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_23",
        "inbound_nodes": [[["bnorm_23", 0, 0, {}]]]
      },
      {
        "class_name": "TFOpLambda",
        "config": {
          "name": "tf.__operators__.add_6",
          "trainable": true,
          "dtype": "float32",
          "function": "__operators__.add"
        },
        "name": "tf.__operators__.add_6",
        "inbound_nodes": [
          [
            "leaky_23",
            0,
            0,
            { "y": ["tf.__operators__.add_5", 0, 0], "name": null }
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_25",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_25",
        "inbound_nodes": [[["tf.__operators__.add_6", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_25",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_25",
        "inbound_nodes": [[["conv_25", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_25",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_25",
        "inbound_nodes": [[["bnorm_25", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_26",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_26",
        "inbound_nodes": [[["leaky_25", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_26",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_26",
        "inbound_nodes": [[["conv_26", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_26",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_26",
        "inbound_nodes": [[["bnorm_26", 0, 0, {}]]]
      },
      {
        "class_name": "TFOpLambda",
        "config": {
          "name": "tf.__operators__.add_7",
          "trainable": true,
          "dtype": "float32",
          "function": "__operators__.add"
        },
        "name": "tf.__operators__.add_7",
        "inbound_nodes": [
          [
            "leaky_26",
            0,
            0,
            { "y": ["tf.__operators__.add_6", 0, 0], "name": null }
          ]
        ]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_28",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [1, 1],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_28",
        "inbound_nodes": [[["tf.__operators__.add_7", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_28",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_28",
        "inbound_nodes": [[["conv_28", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_28",
          "trainable": true,
          "dtype": "float32",
          "alpha": 0.10000000149011612
        },
        "name": "leaky_28",
        "inbound_nodes": [[["bnorm_28", 0, 0, {}]]]
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv_29",
          "trainable": true,
          "dtype": "float32",
          "filters": 256,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "GlorotUniform",
            "config": { "seed": null }
          },
          "bias_initializer": { "class_name": "Zeros", "config": {} },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv_29",
        "inbound_nodes": [[["leaky_28", 0, 0, {}]]]
      },
      {
        "class_name": "BatchNormalization",
        "config": {
          "name": "bnorm_29",
          "trainable": true,
          "dtype": "float32",
          "axis": [3],
          "momentum": 0.99,
          "epsilon": 0.001,
          "center": true,
          "scale": true,
          "beta_initializer": { "class_name": "Zeros", "config": {} },
          "gamma_initializer": { "class_name": "Ones", "config": {} },
          "moving_mean_initializer": { "class_name": "Zeros", "config": {} },
          "moving_variance_initializer": { "class_name": "Ones", "config": {} },
          "beta_regularizer": null,
          "gamma_regularizer": null,
          "beta_constraint": null,
          "gamma_constraint": null
        },
        "name": "bnorm_29",
        "inbound_nodes": [[["conv_29", 0, 0, {}]]]
      },
      {
        "class_name": "LeakyReLU",
        "config": {
          "name": "leaky_29",
          "trainable": true,
